#include <iostream>

using namespace std;

int main(void) {
    unsigned short int options[32] = {
        0x00000001, // шестнадцатеричный литерал для     0000 0000 0000 0001
        0x00000002, // шестнадцатеричный литерал для     0000 0000 0000 0010
        0x00000004, // шестнадцатеричный литерал для     0000 0000 0000 0100
        0x00000008, // шестнадцатеричный литерал для     0000 0000 0000 1000
        0x00000010, // шестнадцатеричный литерал для     0000 0000 0001 0000
        0x00000020, // шестнадцатеричный литерал для     0000 0000 0010 0000
        0x00000040, // шестнадцатеричный литерал для     0000 0000 0100 0000
        0x00000080, // шестнадцатеричный литерал для     0000 0000 1000 0000
        0x00000100, // шестнадцатеричный литерал для     0000 0001 0000 0000
        0x00000200, // шестнадцатеричный литерал для     0000 0010 0000 0000
        0x00000400, // шестнадцатеричный литерал для     0000 0100 0000 0000
        0x00000800, // шестнадцатеричный литерал для     0000 1000 0000 0000
        0x00001000, // шестнадцатеричный литерал для     0001 0000 0000 0000
        0x00002000, // шестнадцатеричный литерал для     0010 0000 0000 0000
        0x00004000, // шестнадцатеричный литерал для     0100 0000 0000 0000
        0x00008000  // шестнадцатеричный литерал для     1000 0000 0000 0000
    };

	unsigned short int val;
	bool ispalindrome = true;
	cout << "value = ";
	cin >> val;
	// Insert your code here

    for (int i = 0; i < 8; i++) {
        if ((bool)(val & options[i]) != (bool)(val & options[15 - i])) {
            ispalindrome = false;
        }
    }

	if (ispalindrome)
		cout << val << " is a bitwise palindrome" << endl;
	else
		cout << val << " is not a bitwise palindrome" << endl;
	return 0;
}
