#include <iostream>

using namespace std;

int main()
{

    unsigned long int options[32] = {
        0x00000001, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0000 0001
        0x00000002, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0000 0010
        0x00000004, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0000 0100
        0x00000008, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0000 1000
        0x00000010, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0001 0000
        0x00000020, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0010 0000
        0x00000040, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 0100 0000
        0x00000080, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0000 1000 0000
        0x00000100, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0001 0000 0000
        0x00000200, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0010 0000 0000
        0x00000400, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 0100 0000 0000
        0x00000800, // шестнадцатеричный литерал для     0000 0000 0000 0000 0000 1000 0000 0000
        0x00001000, // шестнадцатеричный литерал для     0000 0000 0000 0000 0001 0000 0000 0000
        0x00002000, // шестнадцатеричный литерал для     0000 0000 0000 0000 0010 0000 0000 0000
        0x00004000, // шестнадцатеричный литерал для     0000 0000 0000 0000 0100 0000 0000 0000
        0x00008000, // шестнадцатеричный литерал для     0000 0000 0000 0000 1000 0000 0000 0000
        0x00010000, // шестнадцатеричный литерал для     0000 0000 0000 0001 0000 0000 0000 0000
        0x00020000, // шестнадцатеричный литерал для     0000 0000 0000 0010 0000 0000 0000 0000
        0x00040000, // шестнадцатеричный литерал для     0000 0000 0000 0100 0000 0000 0000 0000
        0x00080000, // шестнадцатеричный литерал для     0000 0000 0000 1000 0000 0000 0000 0000
        0x00100000, // шестнадцатеричный литерал для     0000 0000 0001 0000 0000 0000 0000 0000
        0x00200000, // шестнадцатеричный литерал для     0000 0000 0010 0000 0000 0000 0000 0000
        0x00400000, // шестнадцатеричный литерал для     0000 0000 0100 0000 0000 0000 0000 0000
        0x00800000, // шестнадцатеричный литерал для     0000 0000 1000 0000 0000 0000 0000 0000
        0x01000000, // шестнадцатеричный литерал для     0000 0001 0000 0000 0000 0000 0000 0000
        0x02000000, // шестнадцатеричный литерал для     0000 0010 0000 0000 0000 0000 0000 0000
        0x04000000, // шестнадцатеричный литерал для     0000 0100 0000 0000 0000 0000 0000 0000
        0x08000000, // шестнадцатеричный литерал для     0000 1000 0000 0000 0000 0000 0000 0000
        0x10000000, // шестнадцатеричный литерал для     0001 0000 0000 0000 0000 0000 0000 0000
        0x20000000, // шестнадцатеричный литерал для     0010 0000 0000 0000 0000 0000 0000 0000
        0x40000000, // шестнадцатеричный литерал для     0100 0000 0000 0000 0000 0000 0000 0000
        0x80000000  // шестнадцатеричный литерал для     1000 0000 0000 0000 0000 0000 0000 0000
    };

    unsigned long int inputNumber, result = 0;
    cin >> inputNumber;

    for (int i = 0; i < 32; i++) {
        if (inputNumber & options[i]) {
            result++;
        }
    }

    cout << "Count of bits equals 1 is:   " << result;

    return 0;
}